app/controllers/feeds_controller.rb

  def index
    @feeds = Feed.all
---
SELECT "feeds".* FROM "feeds"

  def create
    @feed = Feed.new(feed_params)
    @feed.save
---
INSERT INTO "feeds" ("created_at", "name", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Mon, 23 Mar 2015 00:02:29 UTC +00:00], ["name", "iptorrents"], ["updated_at", Mon, 23 Mar 2015 00:02:29 UTC +00:00], ["url", "http://adsfasdfadsf.com/feed.php?34132412341234"]]

  def update
    @feed.update(feed_params)
---
UPDATE "feeds" SET "url" = ?, "updated_at" = ? WHERE "feeds"."id" = 2  [["url", "http://localhost:3000/feeds/newa"], ["updated_at", Thu, 02 Apr 2015 05:40:51 UTC +00:00]]

  def destroy
    @feed.destroy
---
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 2]]

    def set_feed
      @feed = Feed.find(params[:id])
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "2"]]