app/controllers/rules_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @show = Show.find(params[:show])

INSERT INTO "rules" ("created_at", "feed_id", "regex", "show_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 23 Mar 2015 00:08:02 UTC +00:00], ["feed_id", 1], ["regex", "adsfasdf"], ["show_id", 1], ["updated_at", Mon, 23 Mar 2015 00:08:02 UTC +00:00]]
---
  def create
    @rule = Rule.new(rule_params)
    @show = @rule.show
    @rule.save

UPDATE "rules" SET "regex" = ?, "show_id" = ?, "feed_id" = ?, "updated_at" = ? WHERE "rules"."id" = 1  [["regex", "(computer|restaurant)"], ["show_id", 2], ["feed_id", 2], ["updated_at", Fri, 03 Apr 2015 03:54:11 UTC +00:00]]
---
  def update
    @rule.update(rule_params)

DELETE FROM "rules" WHERE "rules"."id" = ?  [["id", 3]]
---
  def destroy
    @rule.destroy

SELECT "rules".* FROM "rules" WHERE "rules"."id" = ? LIMIT 1  [["id", "4"]]
---
  def set_rule_and_show
    @rule = Rule.find(params[:id])