app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows"
---
  def index
    @shows = Show.all

INSERT INTO "shows" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 22 Mar 2015 22:31:43 UTC +00:00], ["name", "Top Gear"], ["updated_at", Sun, 22 Mar 2015 22:31:43 UTC +00:00]]
---
  def create
    @show = Show.new(show_params)
    @show.save

DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 1]]
---
  def destroy
    @show.destroy

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_show
      @show = Show.find(params[:id])