app/views/rules/_rule.html.erb

    <div class="col-md-2">
      <%= f.select :feed_id, Feed.all.map {|f| [f.name, f.id] }, {}, class: 'form-control' %>
---
SELECT "feeds".* FROM "feeds" ORDER BY "feeds"."id" ASC LIMIT 1